Revit 2027 API
ImportIFCOptions Class
 Provides access to settings that control linking and opening IFC files.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ImportIFCOptions
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ImportIFCOptions : IDisposable
Public Class ImportIFCOptions
	Implements IDisposable
public ref class ImportIFCOptions : IDisposable
type ImportIFCOptions =
    class
        interface IDisposable
    end
The ImportIFCOptions type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LinkProcessor |  Specifies the engine to use while doing a Link IFC operation.
Top
Methods
Name | Description
Dispose | Releases all resources used by the ImportIFCOptions
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetImportIFCOptions |  Returns the current Revit instance's ImportIFCOptions.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.
See Also
Reference
Autodesk.Revit.DB Namespace